flying4fun/ESP8266_APA102_chair/src/main.cpp
#include <Arduino.h>
#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPmDNS.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESP8266mDNS.h>
#endif
#include <ESPAsyncWiFiManager.h>
#include <ArduinoOTA.h>

#include "html_strings.h"

#include "EEPROM.h"
#define FASTLED_ALL_PINS_HARDWARE_SPI
#define ESP8266_SPI
//#define FASTLED_ESP8266_RAW_PIN_ORDER
#include "FastLED.h"

#define buttonPin 0                                           // input pin to use as a digital input
#include "jsbutton.h"                                         // Nice button routine by Jeff Saltzman

// Fixed definitions cannot change on the fly.
#define LED_DT 13                                             // Data pin to connect to the strip.
#define LED_CK 14                                             // Clock pin for WS2801 or APA102.
#define COLOR_ORDER BGR                                       // It's GRB for WS2812 and BGR for APA102.
#define LED_TYPE APA102                                       // Using APA102, WS2812, WS2801. Don't forget to modify LEDS.addLeds to suit.
#define NUM_LEDS 144                                          // Number of LED's.
#define DEBUG true

// Definition for the array of routines to display.
#define ARRAY_SIZE(A) (sizeof(A) / sizeof((A)[0]))

void fadeall(void);
void snakey(void);
void colorbands(void);
void bouncingball(void);
void flashusa(void);
void flashfade(void);
void confetti(void);
void blipouts(void);
void rainbow(void);
void rainbowWithGlitter(void);
void addGlitter(fract8 chanceOfGlitter);
void bpm(void);
void white(void);
void cylon(void);
void landinglight(void);
void fireball(void);
void pulse(void);
void racer(void);
void juggle(void);
void bandcracker(void);
void bandcracker2(void);
void readbutton();

MDNSResponder mdns;
DNSServer dnsServer;
AsyncWebServer webServer(80);
AsyncWiFiManager wifiManager(&webServer, &dnsServer);

//Mode and EEPROM variables
uint8_t maxMode = 20;                                          // Maximum number of display modes. Would prefer to get this another way, but whatever.
int eepaddress = 0;

// Global variables can be changed on the fly.
uint8_t max_bright = 255;                                     // Overall brightness definition. It can be changed on the fly.

int16_t movingled = 0;                                       // variables for moving up and down the LED chain
int16_t movingledA = 0;
int16_t movingledB = 0;
int16_t movingledC = 0;
int16_t movingledD = 0;
int16_t movingledE = 0;
int16_t movingledF = 0;

byte mode = 0;

bool bBounce = 0;
bool bWipe = 0;

bool bLed = 0;
bool bLedA = 0;
bool bLedB = 0;
bool bLedC = 0;
bool bLedD = 0;
bool bLedE = 0;
bool policeCar = 0;

struct CRGB leds[NUM_LEDS];                                   // Initialize our LED array.

uint8_t gCurrentPatternNumber = 0;                            // Index number of which pattern is current
uint8_t gHue = 0;                                             // rotating "base color" used by many of the patterns
uint8_t gSat = 0;                                             // rotating "saturation value"
uint8_t gBrt = 0;                                             // rotating "brightness value"

typedef void (*SimplePatternList[])();                        // List of patterns to cycle through.  Each is defined as a separate function below.
SimplePatternList gPatterns = {fadeall, snakey, colorbands, bouncingball, flashusa, flashfade, confetti, blipouts, rainbow, rainbowWithGlitter, bpm, white, cylon, landinglight, fireball, pulse, racer, juggle, bandcracker, bandcracker2};

long amap(long x, long in_min, long in_max, long out_min, long out_max)
{
  return (x - in_min) * (out_max - out_min + 1) / (in_max - in_min + 1) + out_min;
}


void setup() {
  Serial.begin(115200);
  pinMode(buttonPin, INPUT);                                  // Set button input pin
  digitalWrite(buttonPin, HIGH );

  Serial.println("Booting");
  Serial.println("Free Heap: " + String(ESP.getFreeHeap()));

  Serial.println("Connecting to WiFi.");
  wifiManager.autoConnect();

  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  LEDS.addLeds<LED_TYPE, LED_DT, LED_CK, COLOR_ORDER>(leds, NUM_LEDS);  // Use this for APA102
  //LEDS.addLeds<LED_TYPE, LED_DT, COLOR_ORDER>(leds, NUM_LEDS);  // Use this for WS2812

  FastLED.setBrightness(max_bright);
  set_max_power_in_volts_and_milliamps(5, 5000);               // FastLED Power management set at 5V, 500mA.

  gCurrentPatternNumber = EEPROM.read(eepaddress);

  if (gCurrentPatternNumber > maxMode) gCurrentPatternNumber = 0;   // A safety in case the EEPROM has an illegal value.


  Serial.print("Starting ledMode: ");
  Serial.println(gCurrentPatternNumber);

  gCurrentPatternNumber = 16;


  // Port defaults to 8266
  // ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[ChipID]
  // ArduinoOTA.setHostname("myesp8266");

  // No authentication by default
  // ArduinoOTA.setPassword("admin");

  // Password can be set with it's md5 value as well
  // MD5(admin) = 21232f297a57a5a743894a0e4a801fc3
  // ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");
  ArduinoOTA.setHostname("FastChair");
  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH)
      type = "sketch";
    else // U_SPIFFS
      type = "filesystem";

    // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("  Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
    else if (error == OTA_END_ERROR) Serial.println("End Failed");
  });
  ArduinoOTA.begin();
  Serial.println("Setup of OTA complete");
  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());


  webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send_P( 200, "text/html", tab_manual );
  });

  webServer.on("/power", HTTP_POST, [](AsyncWebServerRequest *request) {
    Serial.print("Set Power: ");
    Serial.print(request->argName(0));
    Serial.print(" = ");
    Serial.println(request->arg(request->argName(0)));
    if(request->args() > 0) {
      if(request->arg("value") == "0") {
        Serial.println("Power OFF");
        // fastled code to power off
      } else {
        Serial.println("Power ON");
        // fastled code to power on
      }
    }
    request->send_P( 200, "text/html", "" );
  });

