flying4fun/ESP8266_APA102_chair/src/main.cpp
void racer(void) {

  black();
  uint8_t redBarLength = NUM_LEDS / 8;
  uint8_t blueBarLength = NUM_LEDS / 22;
  uint8_t whiteBarLength = NUM_LEDS / 15;
  uint8_t carSize = NUM_LEDS/30;

  if (bWipe == 1) {                                             // wipe the display and initialize
    black();
    movingled = 0;
    movingledA = 0;
    movingledB = 0;
    movingledC = 0;
    movingledD = 0;
    movingledE = 0;
    movingledF = 0;
    bLed = 0;
    bLedA = 0;
    bLedB = 0;
    bLedC = 0;
    bLedD = 0;
    bLedE = 0;
    bWipe = 0;
    bBounce = 0;
  }


  if (bLedC == 0 && bLedD == 0 && bLedE == 0) {                                     // Start red sequence immediately if none are running          DEBUG FIX!
    bLedC = 1;
  }

  if (bLed == 0) {                                                                  // Start white movingled randomly
    EVERY_N_MILLISECONDS(100) {
      if (random8(1, 100) <= 1) {
        bLed = 1;
      }
    }
  }

  if ((bLedA == 0 && movingledB > NUM_LEDS/4) || (bLedA == 0 && bLedB == 0)) {      // Start blue movingledA
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedA = 1;
      }
    }
  }

  if (bLedB == 0 && movingledA > NUM_LEDS/4) {                                      // Start blue movingledB
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedB = 1;
      }
    }
  }

  if (bLedC == 0 && movingledE > NUM_LEDS/4) {                                      // Start red movingledC
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedC = 1;
      }
    }
  }

    if (bLedD == 0 && movingledC > NUM_LEDS/4) {                                      // Start red movingledD
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedD = 1;
      }
    }
  }

    if (bLedE == 0 && movingledD > NUM_LEDS/4) {                                      // Start red movingledE
    EVERY_N_MILLISECONDS(20) {
      if (random8(1, 100) <= 1) {
        bLedE = 1;
      }
    }
  }

  if (bLedC == 1) {                                                                   //sequence movingledC here
    for (int i = 0; i <= redBarLength; i++) {
      if ((movingledC-i) >= 0) {
        if(movingledC-i < NUM_LEDS) {
          leds[movingledC-i] = CRGB::Red;
        }
      }
    }
    if ((movingledC - redBarLength) >= NUM_LEDS) {                                       // Reset
      bLedC = 0;
      movingledC = 0;
    }
    EVERY_N_MILLISECONDS(30) {
      movingledC++;
    }
  }

  if (bLedD == 1) {                                                                   //sequence movingledD here
    for (int i = 0; i <= redBarLength; i++) {
      if ((movingledD-i) >= 0) {
        if(movingledD-i < NUM_LEDS) {
          leds[movingledD-i] = CRGB::Red;
        }
      }
    }
    if ((movingledD - redBarLength) >= NUM_LEDS) {                                       // Reset
      bLedD = 0;
      movingledD = 0;
    }
    EVERY_N_MILLISECONDS(30) {
      movingledD++;
    }
  }

  if (bLedE == 1) {                                                                   //sequence movingledE here
    for (int i = 0; i <= redBarLength; i++) {
      if ((movingledE-i) >= 0) {
        if(movingledE-i < NUM_LEDS) {
          leds[movingledE-i] = CRGB::Red;
        }
      }
    }
    if ((movingledE - redBarLength) >= NUM_LEDS) {                                       // Reset
      bLedE = 0;
      movingledE = 0;
    }
    EVERY_N_MILLISECONDS(30) {
      movingledE++;
    }
  }

  if (bLedA == 1) {                                                                   //sequence movingledA here
    for (int i = 0; i <= blueBarLength; i++) {
      if ((movingledA-i) >= 0) {
        if(movingledA-i < NUM_LEDS) {
          leds[movingledA-i] = CRGB::Blue;
        }
      }
    }
    if ((movingledA - blueBarLength) >= NUM_LEDS) {                                       // Reset
      bLedA = 0;
      movingledA = 0;
    }
    EVERY_N_MILLISECONDS(10) {
      movingledA++;
    }
  }

  if (bLedB == 1) {                                                                   //sequence movingledB here
    for (int i = 0; i <= blueBarLength; i++) {
      if ((movingledB-i) >= 0) {
        if(movingledB-i < NUM_LEDS) {
          leds[movingledB-i] = CRGB::Blue;
        }
      }
    }
    if ((movingledB - blueBarLength) >= NUM_LEDS) {                                       // Reset
      bLedB = 0;
      movingledB = 0;
    }
    EVERY_N_MILLISECONDS(10) {
      movingledB++;
    }
  }

  if (bLed == 1) {                                                                   //sequence movingled here
    for (int i = 0; i <= whiteBarLength; i++) {
      if ((movingled-i) >= 0) {
        if(movingled-i < NUM_LEDS) {
          leds[movingled-i] = CRGB(255,180,80);
        }
      }
    }

    if (policeCar == true) {
      for (int i = 0; i <= carSize; i++) {
        if ((movingledF-i) >= 0) {
          if(movingledF-i < NUM_LEDS) {
            if (bBounce == 0) {
              if (i < (carSize/3)) {
                leds[movingledF-i] = CRGB::Blue;
              } else {
                leds[movingledF-i] = CHSV(34,255,100);
              }
            } else {
               if (i > ((carSize/3) * 2)) {
                leds[movingledF-i] = CRGB::Red;
              } else {
                leds[movingledF-i] = CHSV(34,255,100);
              }
            }
          }
        }
        if (i == carSize) {
          EVERY_N_MILLISECONDS(100) {
            bBounce = !bBounce;
          }
        }
      }
    }

    if ((movingledF - carSize) >= NUM_LEDS) {                             // reset white and police car
      bLed = 0;
      movingled = 0;
      movingledF = 0;
      if (random8(1) < 1) {                                               //randomly turn police car on and off
        policeCar = !policeCar;
      }
    }
    movingled += (NUM_LEDS/60);
    movingledF = (((movingled) / 2) - (whiteBarLength + (NUM_LEDS / 10))) ;
  }

} //racer


void bandcracker() {

  if (bWipe == 1) {                                             // wipe the display
    black();
    bWipe = 0;
    gHue = 0;
    movingledA = (NUM_LEDS/2);
    movingledB = (NUM_LEDS/2);
    bBounce = 0;
  }

  if (bBounce == 1) {
    gHue += (random8(16, 48));
    movingledA = (NUM_LEDS/2);
    movingledB = (NUM_LEDS/2);
    leds[movingledA] = CHSV(gHue, 255, 255);
    bBounce = 0;
  }

  if (movingledA < (NUM_LEDS - 2)) {
    movingledA++;
    leds[movingledA] = CHSV(gHue, 255, 255);
  } else {
    bBounce = 1;
  }
  if (movingledB > 0) {
    movingledB--;
    leds[movingledB] = CHSV(gHue, 255, 255);
  } else {
    bBounce = 1;
  }
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].nscale8(random8(125, 250));
    leds[i] += leds[i].nscale8(random8(105, 244));
  }
}


void bandcracker2() {

  if (bWipe == 1) {                                             // wipe the display
    black();
    bWipe = 0;
    gHue = 0;
    movingledA = 0;
  }

  uint16_t mark = movingledA;

  if (movingledA == 0 || movingledA == (NUM_LEDS-1)) {
    gHue += (random8(24, 64));
  }

  movingledA = beatsin16(30, 0, NUM_LEDS - 1, NUM_LEDS/2);
  if ((movingledA - mark ) > 1) {
    for (int j = mark; j < movingledA; j++) {
      leds[j] = CHSV(gHue, 255, 255);
    }
  } else {
    leds[movingledA] = CHSV(gHue, 255, 255);
  }
  if ((mark - movingledA) > 1) {
    for (int j = movingledA; j < mark; j++) {
      leds[j] = CHSV(gHue, 255, 255);
    }
  } else {
    leds[movingledA] = CHSV(gHue, 255, 255);
  }


  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].nscale8(random8(125, 250));
    leds[i] += leds[i].nscale8(random8(105, 244));
  }
}
